{"project": [{"project_name": ["Good Meal"], "time": ["Hackathon Project"], "position": ["Full Stack Developer"], "domain": ["N/A"], "used_technologies": ["Node.js", "APIs"], "detailed_descriptions": ["Led a full-stack development team for the 'Good Meal' project, driving successful project execution.", "Improved expertise in Node.js, utilizing APIs for data integration and optimizing response formatting.", "Enhanced accuracy and resolved errors in chat GPT system, contributing to improved performance and user experience."]}], "experience": [{"company_name": ["Drexel University"], "time": ["May. 2022 - June. 2023"], "position": ["Researcher"], "domain": ["NLP"], "used_technologies": ["N/A"], "detailed_descriptions": ["Collaborated with Professor Shadi Rezapour on developing an NLP model to identify and categorize substance abuse from social networks.", "Collected, assembled, and preprocessed data from 35 subreddits spanning over 4 years.", "Designed a high-performance pipeline for downloading Reddit data, achieving a 13500x speed improvement compared to the standard Reddit library.", "Our paper, Healing with Artificial Intelligence (HEART) Data Pipeline, is being reviewed by American Medical Informatics Association."]}, {"company_name": ["Drexel University"], "time": ["Sep. 2021 - March. 2022"], "position": ["Junior Developer"], "domain": ["Software Development"], "used_technologies": ["Java", ".Net", "web technology stacks"], "detailed_descriptions": ["Built software solutions to extend the functionality of existing Drexel University systems using Java, .Net, and web technology stacks.", "Translated business requirements into formal software specifications.", "Created, extended and maintained Java web applications, developed data models to be deployed in Microsoft SQL Server, Oracle, NoSQL and PostgreSQL databases."]}, {"company_name": ["FPT.AI"], "time": ["Oct. 2020 - March. 2021"], "position": ["Software Engineer Intern"], "domain": ["ID Fraud Detection"], "used_technologies": ["N/A"], "detailed_descriptions": ["Refined and deployed an advanced ID fraud detection model for Vietnamese national ID cards, surpassing the company’s existing model in accuracy and speed. Enhanced fraud detection capabilities and successfully implemented for commercial use.", "Collected, assembled, and preprocessed raw data to support multiple model training needs, ensuring the availability of high-quality data for accurate and effective modeling.", "Designed, cultivated, and deployed an ID fraud detection app utilizing the EfficientNet model fine-tuned on scanned ID images, incorporating user-friendly features and interfaces, conducting thorough testing and validation, and providing training and support to ensure its successful adoption and use."]}, {"company_name": ["WhyFit"], "time": ["Sep. 2019 - March. 2020"], "position": ["Full Stack Developer"], "domain": ["Wellness Benefits"], "used_technologies": ["Ruby on Rails", "HTML", "CSS", "JavaScript"], "detailed_descriptions": ["Developed new features that help businesses run and manage their wellness benefits and initiatives from an administrative and end-user perspective by primarily using Ruby on Rails, HTML, CSS, JavaScript.", "Built a dynamic page for the resources section of the website that allows users to select wellness businesses that would display on Google Maps and implemented the new tool into the web page.", "Worked on the implementation of third-party services into the WhyFit platform. Used FitBit API and Apple Health API for iOS to collect personal data and incorporated it with the WhyFit system.", "Collaborated with the sales team to develop a script using Python and Telnet protocol that would check if the email address on the WhyFit mailing list exists on the email recipient server and is valid."]}], "strength": ["Strong problem-solving skills", "Excellent programming abilities", "Effective communication skills"], "weakness": ["Limited experience in large-scale project management", "Less familiarity with certain programming languages and frameworks"], "numerology": ["N/A"], "personal_information": {"name": "Minh Nguyen", "earliest_university_year": "N/A", "earliest_university_name": "N/A", "birthday": "N/A", "gender": "N/A", "nationality": "N/A", "desired_position": "N/A", "desired_salary": "N/A", "desired_work_location": "N/A"}, "contact_information": {"phone": ["+267 939 7112"], "email": ["minhkhac.pro@gmail.com"], "address": {"street": ["N/A"], "ward": ["N/A"], "district": ["N/A"], "province/city": ["N/A"]}, "urls": ["N/A"]}, "education": [{"institution_name": ["Drexel University"], "time": ["Expected 2023"], "degree": ["Bachelor of Science in Computer Science"], "major": ["N/A"], "gpa": ["N/A"]}], "skills": {"spoken_language": ["N/A"], "programming_language": ["Python", "Java", "Javascript"], "soft_skill": ["N/A"], "hard_skill": ["Visual Studio", "Visual Studio Code", "Jupyter Notebook", "Google Colab", "Sublime Text 3", "PostgreSQL"]}, "certificates": {"language_certificates": ["N/A"], "other_certificates": ["N/A"]}, "achievements_and_honors": ["N/A"], "references": [{"name": ["N/A"], "company": ["N/A"], "phone": ["N/A"], "email": ["N/A"]}], "publications": [{"title": ["N/A"], "author_name": ["N/A"], "year": ["N/A"]}], "objectives": ["N/A"], "social_activities": ["N/A"], "hobbies_and_interests": ["N/A"], "iq": {"iq_level": ["Level 4: Average - IQ scores between 90 and 109"], "explanation": ["Based on the information provided in the resume, the candidate demonstrates average cognitive abilities or intelligence."]}, "eq": {"self_awareness_level": ["N/A"], "self_regulation_level": ["N/A"], "motivation_level": ["N/A"], "empathy_level": ["N/A"], "social_skills_level": ["N/A"], "explanation": ["N/A"]}, "summary": ["Minh Nguyen is a highly skilled and motivated computer science student with a strong background in software development and machine learning. They have experience in developing software solutions, conducting research, and implementing advanced models for fraud detection and substance abuse identification. Minh possesses excellent problem-solving skills, effective communication abilities, and a passion for leveraging artificial intelligence to improve healthcare and wellness. They are seeking opportunities to further enhance their skills and contribute to impactful projects in the industry."], "industry": ["Computer Software", "Information Technology and Services", "Research"]}